; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v5 - type_2 ?v2 - type_1)
 	      (pred_2 ?v6 - object ?v2 - type_1)
	      (pred_1 ?v5 - type_2 ?v1 - type_3)
	      (pred_4 ?v5 - type_2 ?v6 - object ?v1 - type_3))

   (:action op_1
       :parameters  (?v5 - type_2 ?v3 ?v7 - type_1)
       :precondition (and  (pred_3 ?v5 ?v3))
       :effect (and  (pred_3 ?v5 ?v7)
		     (not (pred_3 ?v5 ?v3))))

   (:action op_3
       :parameters (?v5 - type_2 ?v8 - object ?v4 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v4) (pred_3 ?v5 ?v4) (pred_1 ?v5 ?v1))
       :effect (and (pred_4 ?v5 ?v8 ?v1)
		    (not (pred_2 ?v8 ?v4)) 
		    (not (pred_1 ?v5 ?v1))))

   (:action op_2
       :parameters (?v5 - type_2 ?v8 - object ?v4 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_4 ?v5 ?v8 ?v1) (pred_3 ?v5 ?v4))
       :effect (and (pred_2 ?v8 ?v4)
		    (pred_1 ?v5 ?v1)
		    (not (pred_4 ?v5 ?v8 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_05 obj_01 - type_2
obj_08 obj_03 obj_11 obj_04 - type_3
obj_06 obj_07 obj_10 - type_1
obj_12 obj_09 obj_02 - object)
(:init
(pred_3 obj_05 obj_06)
(pred_1 obj_05 obj_08)
(pred_1 obj_05 obj_03)
(pred_3 obj_01 obj_10)
(pred_1 obj_01 obj_11)
(pred_1 obj_01 obj_04)
(pred_2 obj_12 obj_07)
(pred_2 obj_09 obj_07)
(pred_2 obj_02 obj_07)
)
(:goal
(and
(pred_2 obj_12 obj_07)
(pred_2 obj_09 obj_10)
(pred_2 obj_02 obj_10)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_05 obj_10) (pred_3 obj_01 obj_10))))
  )
)
)

; plan
1. (op_1 obj_05 obj_06 obj_07)
   deleted: (pred_3 obj_05 obj_06)
   added: (pred_3 obj_05 obj_07)
   goals met: 1 of 3
2. (op_1 obj_01 obj_10 obj_07)
   deleted: (pred_3 obj_01 obj_10)
   added: (pred_3 obj_01 obj_07)
   goals met: 1 of 3
3. (op_3 obj_05 obj_02 obj_07 obj_03)
   deleted: (pred_2 obj_02 obj_07) (pred_1 obj_05 obj_03)
   added: (pred_4 obj_05 obj_02 obj_03)
   goals met: 1 of 3
4. (op_3 obj_05 obj_09 obj_07 obj_08)
   deleted: (pred_2 obj_09 obj_07) (pred_1 obj_05 obj_08)
   added: (pred_4 obj_05 obj_09 obj_08)
   goals met: 1 of 3
5. (op_1 obj_05 obj_07 obj_10)
   deleted: (pred_3 obj_05 obj_07)
   added: (pred_3 obj_05 obj_10)
   goals met: 1 of 3
6. (op_2 obj_05 obj_02 obj_10 obj_03)
   deleted: (pred_4 obj_05 obj_02 obj_03)
   added: (pred_2 obj_02 obj_10) (pred_1 obj_05 obj_03)
   goals met: 2 of 3
7. (op_2 obj_05 obj_09 obj_10 obj_08)
   deleted: (pred_4 obj_05 obj_09 obj_08)
   added: (pred_2 obj_09 obj_10) (pred_1 obj_05 obj_08)
   goals met: 3 of 3
